{
  "title": "Agile Development Methods",
  "path": "/industry_skills/agile_development",
  "subpages": [],
  "content": [
    {
      "type": "text",
      "display": "",
      "heading": "Basics",
      "material": "Agile development aim to reduce the delivery time for working software systems by interleaving program specification, design and implementation. Most software engineering teams will apply core concepts of these methodologies to their development cycles although in practice it can be difficult to achieve \"perfect\" agile development. Ideally there are frequent system releases to enable continuous feedback from users and to maintain simplicity through constant refactoring of code. Pair programming is also common among agile teams and involves programmers working in pairs to develop code together. This helps develop common ownership of code and spread knowledge across the team, which is invaluable when new members join the team."
    },
    {
      "type": "image",
      "height": 400,
      "width": 400,
      "caption": "A comparison between plan-based development cycles and agile development cycles",
      "material": "development_cycles.png"
    },
    {
      "type": "text",
      "display": "list",
      "heading": "Applications in Industry",
      "section_description": "Scrum is an agile method that focuses on managing iterative development rather than specific agile practices. It can be simplified into three phases:",
      "material": [
        "Initial Phase - used to establish the general objectives for the project and design the software architecture",
        "Sprint Cycles - each cycle develops an increment of the system. A cycle is typically 2 to 4 weeks long",
        "Project Closure Phase - completes required documentation (e.g. system help frames and user manuals) and assesses the lessons learned from the project"
      ]
    },
    {
      "type": "image",
      "height": 500,
      "width": 500,
      "caption": "Stages of a Scrum sprint cycle",
      "material": "sprint_cycle.png"
    },
    {
      "type": "text",
      "display": "",
      "heading": "",
      "material": "A Scrum master is responsible for ensuring the Scrum process is followed and channelling communications from users and the rest of the organization to minimise distractions for the development team. Products are broken down into sets of manageable and understandable chunks that are assigned to team members to complete before the end of the sprint. These chunks can be known as tickets which form part of a sprint board, where the whole team have visibility of everything that is being worked on. As progress is made, the state of a ticket is changed to reflect what has been done such as moving from \"In Progress\" to \"Testing\". Sprint boards are reviewed in short daily meetings (often called Stand-ups), where each member of the team describes what they achieved since the last meeting and what is planned for the following day. These meetings allow for adaptions to be made when problems arise and more collaboration between team members."
    },
    {"type": "scrum-board"}
  ]
}