{
  "title": "Assessment Centres",
  "path": "/assessment_centres",
  "icon": "fas fa-briefcase",
  "subpages": [
    {
      "title": "Group Exercises",
      "path": "/assessment_centres/group_exercises",
      "summary": "Applicants are placed into groups and expected to solve a problem by working together and agreeing on a solution within a set time limit"
    },
    {
      "title": "Technical Assessments",
      "path": "/assessment_centres/technical_assessments",
      "summary": "Technical assessments are used to test an applicant's technical knowledge by solving problems or completing tasks"
    },
    {
      "title": "Presentations",
      "path": "/assessment_centres/presentations",
      "summary": "Recruiters can ask applicants to prepare presentations individually or as a group"
    }
  ],
  "content": [
    {
      "type": "text",
      "display": "",
      "heading": "",
      "material": "Assessment Centres involve a combination of assessed tasks and activities that test an applicant's suitability for the job. They are typically one of the final stages in the recruitment process where employers observe a group of applicants and how they perform together and individually. Assessment Centres can last from a few hours to a few days and it is important to remember that between tasks, such as during meals and gaps in the schedule, observations continue. This is a chance to show interpersonal skills by asking questions to employees along with other candidates who could end up being colleagues."
    },
    {
      "type": "text",
      "display": "",
      "heading": "Preparation",
      "material": "Before an assessment centre applicants are sent information by the potential employer, such as the schedule, dress code and location. Research into the company (and competitors), industry, role and details of the opportunity on offer is vital preparation before an Assessment Centre as it will help in interviews, presentations and conversations throughout the day."
    }
  ]
}