{
  "title": "Cover Letters",
  "path": "/cvs_and_cover_letters/cover-letter",
  "subpages": [],
  "content": [
    {
      "type": "text",
      "display": "",
      "heading": "Basics",
      "material": "There are many variations of cover letters including personal statements, an accompanying email, motivational statement or a supporting statement. Having a skeleton of a cover letter \"ready to go\" is great for applying to multiple job opportunities, which gives insight to an applicant's skills and motivations for applying. However, it is vital to tailor a cover letter to the organization being applied to and provide information to spotlight the important and relevant details within the CV. If you are uncertain of what to write, there is a large variety of online templates and examples that can be adapted for your skill set and application."
    },
    {
      "type": "video",
      "material": "https://youtu.be/hrZSfMly_Ck"
    },
    {
      "type": "text",
      "display": "",
      "heading": "Applying by Email",
      "material": "When emailing a CV and Cover Letter to a potential employer, you should make sure it comes from professional email such as your student email or one containing simply your name (no nicknames). Use the same font type and size in both documents to portray consistency. If you have been asked to send your application by email, you can attach both letter and CV to a brief email. Alternatively, you can use the covering letter as the text of the email and attach your CV.  Make sure you follow any instructions the employer has given"
    },
    {
      "type": "text",
      "display": "",
      "heading": "Speculative letters",
      "material": "A speculative application is sent to an organization to see if they have any opportunities which have not yet been advertised. It can be a good way of sourcing work experience or working shadowing. Good research and careful thinking around the employer/organization will help you to suggest roles/areas you are interested in. Along with a well researched speculative letter, try to think about the employer's point of view by explaning what you can bring to the organisation. Write about relevant experience or your interest in the area of work and lots of enthusiasm."
    },
    {
      "type": "text",
      "display": "list",
      "heading": "Checklist",
      "section_description": "Before sending a cover letter remember to check the following:",
      "material": [
        "Proof Read -  Check the document for grammatically or spelling errors, particularly make sure all names are spelled correctly. It can be helpful to have it read back to you using either Google Translate or the Read Aloud function within Microsoft Word (under Review)",
        "Be Clear - Make it clear what you are looking for, i.e. a meeting to discuss your CV further, an interview or work shadowing. If it is a speculative letter, explain you will follow it up with a phone call in the near future",
        "Be Concise - Try not to write more than one side of A4 as many recruiters do not have time to read essays from every applicant",
        "Contact - Always try to write to a specific, named person using their correct title. If job advertisement doesn't have a named person, research the organization to find who is in charge of recruitment",
        "End the Letter Correctly - If you address the letter to a name person (i.e. \"Dear Ms Smith\"), sign off with \"Yours sincerely\". Use \"Yours faithfully\" if the letter is addressed to \"Dear Sir/Madam\"."
      ]
    }
  ]
}