{
  "title": "Personality Assessments",
  "path": "/psychometric_tests/personality",
  "subpages": [],
  "content": [
    {
      "type": "text",
      "material": "There are a vast variety of personally assessments used by employers to find appropriate candidates. It's important to not to focus on giving the \"right\" answers because the aim is to assess if YOU are the ideal candidate, which can only be achieved if you answer honestly. Make sure you read all of the options before answering and remain consistent throughout."
    },
    {
      "type": "text",
      "display": "list",
      "heading": "Myers-Briggs Type Indicator",
      "section_description": "The Myers-Briggs Type Indicator (MBTI) test is a very popular personality assessment that uses a series of questions to categorise people into one of 16 different personality types. These personality types are based on four distinct traits and an underlying identity aspect:",
      "material": [
        "How you interact with others - Extrovert vs Introvert",
        "How you access information - Sensing vs Intuition",
        "How you make decisions - Thinking vs Feeling",
        "How you deal with the world - Judging or Perceiving",
        "How confident you are in your abilities and decisions - Assertive vs Turbulent"
      ]
    },
    {
      "type": "image",
      "height": 75,
      "material": [
        {
          "caption": "Take the Myers-Briggs Personality test",
          "path": "https://www.16personalities.com/free-personality-test",
          "image": "myers-briggs.svg"
        }
      ]
    },
    {
      "type": "text",
      "heading": "Caliper Profile",
      "section_description": "The Caliper Profile is an objective assessment that measures an individual’s personality characteristics and individual motivations in order to predict on-the-job behaviors and potential. The results show key personality traits related to skills within the job environment. The test is split into a behavioural section and a cognitive section, and will take a couple of hours to complete. Caliper Profiles are tailored for different jobs so the results will vary between applications."
    },
    {
      "type": "video",
      "material": "https://youtu.be/w3-dveTlgbw"
    }
  ]
}