{
  "title": "Writing a CV",
  "path": "/cvs_and_cover_letters/cv",
  "subpages": [],
  "content": [
    {
      "type": "text",
      "display": "list",
      "heading": "Things to Include",
      "material": [
        "Name - use your name as the heading, include the name you like to be known as if this is different from your official name.  Use capital letters for the first letter of your first name and surname",
        "Contact details – you can include your full address, or if you prefer, your location e.g. Reading. Include your contact phone number and a professional looking email address, which includes your name.  You can add a link to your LinkedIn account if it is up to date or creative portfolio/website link",
        "Employment history (if applicable ) - start with your current or most recent job and include how long you were employed. Also add information about the role and the responsibilities you had",
        "Education – start with your current course and include the full course title and date you started to present and university e.g. September 2019-Present BSc Computer Science with Industrial Year, University of Reading and include results if required.  Many internship, placements and graduate roles require certain grades",
        "Interests - list interests or relevant experience you have related to the job that does not fit within the other sections. This could include volunteering, certifications and achievements"
      ]
    },
    {
      "type": "video",
      "material": "https://youtu.be/_fP43gcBywU"
    },
    {
      "type": "text",
      "display": "sections",
      "heading": "Building the Perfect CV",
      "material": [
        {
          "subheading": "1. Choose the story you want to tell",
          "text": "Use your CV to construct a narrative about yourself. This could be your track record of high achievement, your long-held commitment to a profession or anything in your personal backstory."
        },
        {
          "subheading": "2. Select the best structure",
          "text": "Consider how to group together your experiences and extracurriculars and which headings to use that will enhance your story. For instance, if you want to convey a track record of high achievement, you could open your CV with a section listing professional and volunteering achievements. Ensure you choose examples that emphasise how you will be right for the job and write them up in such a way that showcases your skills."
        },
        {
          "subheading": "3. Talk the employer's language",
          "text": "Tailor your story so that your CV immediately tells the recruiter that you are the candidate they are looking for. When writing up the individual elements of your CV provide examples of the skills, behaviours and values that the employer wants (typically listed in the job description). When you write your CV, analyse the language the employer uses and echo it. Incorporate the key skills, experience, values and behaviours the employer seeks through your CV and make sure that they appear prominently by highlighting them in bold or in colour when this will not detract from the legibility."
        },
        {
          "subheading": "4. Put yourself at the centre and in context",
          "text": "Provide sufficient context to follow your story and gauge your achievements as employers will not necessarily recognise your previous employers or student societies. Make sure you outline the background to the task, the actions you took and your personal results."
        },
        {
          "subheading": "5. Create talking points for interview",
          "text": "You could be asked about anything on your CV in an interview and the best interviews turn into natural conversations, so add possible talking points throughout your CV. If you have an out-of-the-ordinary hobby or a gap-year experience that taught you valuable skills, include it. \"The key thing is to ensure that you are passionate about the interests and extracurricular activities on your CV so that you can talk about them in-depth and set yourself apart during interviews.\" - James Edmunds (a graduate product manager for L’Oréal)"
        },
        {
          "subheading": "6. Make any gaps in your CV part of your story",
          "text": "You do not have to make sure that every university holiday is accounted for, but if there are unusual or unaccounted for periods of time on your CV (such as taking an extra year or two to complete your degree or a year of unemployment), employers will clock them. These gaps can be addressed directly in the CV or sections can be added (such as skills) to make the gaps less obvious. If you do choose to address the gap directly, be factual and focus on the positives."
        }
      ]
    }
  ]
}